[
  {
    "title": "Quality 4.0: Untersuchung von Herausforderungen bei der Implementierung von Quality 4.0 in kleinen und mittleren Unternehmen am Beispiel einer Fallstudie aus der Fertigungsindustrie (Exposé)",
    "text": "Exposé für Bachelorarbeit im Modul BADITT. Quality 4.0 beschreibt die Integration von digitalen Technologien in das Qualitätsmanagement, um Prozesse zu optimieren und die Produktqualität zu verbessern.",
    "moduleId": "BADITT",
    "imageDescription": "A man in blue work attire holds a tablet, checking quality data or a production log. Only his hands and forearms are visible. In the background, slightly blurred, is a modern, clean manufacturing hall with a large metallic component or machine ready for inspection. The focus is on the tablet, representing the digital component of quality control in the manufacturing industry.",
    "date": "15.09.2025"
  },
  {
    "title": "Konzeption eines Lastenhefts und Pflichtenhefts für eine betriebsinterne Softwarelösung (Projektbericht)",
    "text": "Ohne adäquate Planungsinstrumente besteht das Risiko, dass Zeitrahmen und Budgets schnell überschritten werden. Um solche Risiken zu minimieren, bieten Lasten- und Pflichtenhefte als bewährte Werkzeuge der Softwareentwicklung einen strukturierten Ansatz.",
    "moduleId": "BADITP",
    "imageDescription": "Illustration of two books lying on top of a wooden desk.",
    "date": "02.11.2024"
  },
  {
    "title": "Big Data und Prozessmanagement im Unternehmenseinsatz",
    "text": "Lange Zeit blieben digitale Datenmassen ungenutzt. Wie können Unternehmen Big Data im Geschäftsprozessmanagement nutzen, um daraus Chancen und Erkenntnisse zu gewinnen? Im Fokus dieser Arbeit steht zudem die Beantwortung der Frage, welche Herausforderungen und Risiken mit Big Data verbunden sind.",
    "moduleId": "ANS43",
    "imageDescription": "Illustration of data running down a river like stream into a valley.",
    "date": "14.11.2021"
  },
  {
    "title": "Blockchain - eine erfolgreiche Technologie auch außerhalb des FinTech-Sektors?",
    "text": "Blockchain war zweifellos das Buzzword des letzten Jahrzehnts, aber wie sieht es tatsächlich in der Praxis aus? In dieser Arbeit werden mögliche Anwendungen untersucht, erfolgreiche Beispiele vorgestellt und potenzielle Gefahren für Nutzer und Unternehmen aufgezeigt.",
    "moduleId": "DIT61",
    "imageDescription": "Closeup of computer pcb",
    "date": "01.05.2023"
  },
  {
    "title": "KI – Top-Technologie für Start-ups?",
    "text": "Einige Experten prophezeien, dass Unternehmen ohne den Einsatz von KI bald ihre Wettbewerbsfähigkeit verlieren könnten. Es ist offensichtlich: Die Ära der Künstlichen Intelligenz ist nicht nur angebrochen, sondern prägt bereits jetzt maßgeblich unsere Art zu leben und zu arbeiten. Das Thema bringt nicht nur Innovationen, sondern wirft auch wichtige Fragen zu Risiken und Herausforderungen auf, die es zu beachten gilt.",
    "moduleId": "DIT62",
    "imageDescription": "Roboter typing on a laptop",
    "date": "09.11.2023"
  },
  {
    "title": "Datenmanagement",
    "text": "Datenmanagement, Datensicherung und Archivierung sind essentielle Aspekte in der heutigen Informationsgesellschaft. In dieser Arbeit werden Nutzen und Aufwand dieses Prozesses diskutiert. Zudem werden die Vor- und Nachteile verschiedener Datensicherungsmedien für die Langzeitarchivierung untersucht und anhand einer fiktiven Fallstudie ein Datenmanagement- und Archivierungskonzept entwickelt.",
    "moduleId": "IMG40",
    "imageDescription": "Isometric image of computers and servers circled around a cloud",
    "date": "24.03.2021"
  },
  {
    "title": "Herausforderungen der Personalentwicklung im Zeitalter der Digitalisierung",
    "text": "Die Digitalisierung bringt einen tiefgreifenden Wandel mit sich, der nicht nur Unternehmen, sondern auch die Personalentwicklung vor neue Herausforderungen stellt. In dieser Arbeit wird einen Blick auf die wachsende Bedeutung der Personalentwicklung geworfen und die mögliche Herausforderungen reflektiert.",
    "moduleId": "PER25",
    "imageDescription": "Closeup of person typing on laptop",
    "date": "31.12.2019"
  },
  {
    "title": "Personalführung im digitalen Zeitalter: Merkmale und Bedeutung der Ambidextrie",
    "text": "In Zeiten der Digitalisierung stellen sich Unternehmen die Frage, wie sie sich profitabel und zukunftsorientiert positionieren können. Gleichzeitig rücken die Mitarbeiter als wichtigste Ressource eines Unternehmens in den Fokus. Wie lässt sich des Konzepts Ambidextrie eine Balance zwischen Stabilität und Innovation finden?",
    "moduleId": "PER26",
    "imageDescription": "Employees sitting at a conference table. In the background there is a whiteboard with different charts.",
    "date": "01.02.2021"
  },
  {
    "title": "Wissensmanagement",
    "text": "In einer überfluteten Informationslandschaft gewinnt der bewusste Umgang mit Wissen immer mehr an Bedeutung für Unternehmen. Um im Wettbewerb zu bestehen, müssen sie ihr Wissenspotenzial systematisch erschließen und eine ganzheitliche Wissenskultur etablieren. In drei Fallstudien wird aufgezeigt, wie erfolgreiches Wissensmanagement in der Praxis umgesetzt werden kann.",
    "moduleId": "PEW62",
    "imageDescription": "2d illustration of people working together and using modern technologies like laptops. The background is made of pcb like connections and gears.",
    "date": "26.02.2023"
  },
  {
    "title": "Bedeutung und Methoden der Visualisierung von Inhalten in einer Präsentation",
    "text": "Eine überzeugende Visualisierung von Inhalten spielt in Präsentationen eine entscheidende Rolle, um Informationen effektiv zu vermitteln. In dieser Arbeit werden die Bedeutung der Visualisierung von Inhalten untersucht und verschiedene Methoden vorstellt, um Präsentationen visuell ansprechend und wirkungsvoll zu gestalten.",
    "moduleId": "SQF20",
    "imageDescription": "Modern conference room with four chairs and and round table. Behind the table there is a whiteboard with different kind of charts (e.g. pie chart)",
    "date": "21.03.2019"
  },
  {
    "title": "Konzeption einer Benutzerdokumentation",
    "text": "Die Benutzerdokumentation ist ein wesentlicher Bestandteil der Softwareentwicklung und ein kritischer Faktor für die Benutzererfahrung und -zufriedenheit. In dieser Arbeit wurde eine solche Dokumentation für die Software repeatio.de konzipiert. Die Dokumentation ist verfügbar unter: https://rllyyy.github.io/repeatio-docs/",
    "moduleId": "SWE61",
    "imageDescription": "Illustration of a person reading a manual",
    "date": "08.04.2024"
  },
  {
    "title": "Planung einer Implementierungsstrategie für die Einführung einer Künstlichen Intelligenz (KI) im Unternehmen",
    "text": "Wie Unternehmen Künstliche Intelligenz strategisch, rechtssicher und nachhaltig einführen können - ein praxisnaher Leitfaden mit Blick auf Technik, Organisation und Wandel.",
    "moduleId": "SWE62",
    "imageDescription": "A split visual showing human hands on one side and robotic hand elements on the other, connected in the middle",
    "date": "15.01.2024"
  },
  {
    "title": "SWOT-Analyse",
    "text": "In einer sich ständig verändernden Geschäftswelt stehen Unternehmen vor immer neuen Herausforderungen. Die SWOT-Analyse hat sich dabei als ein wertvolles Instrument zur Strukturierung und Formulierung strategischer Entscheidungen etabliert. Wie sie zur Steigerung der Wettbewerbsfähigkeit und zur Erreichung der Unternehmensziele beiträgt, wird anhand einer fiktiven Fallstudie erläutert.",
    "moduleId": "UFU50",
    "imageDescription": "",
    "date": "15.12.2022"
  },
  {
    "title": "Digitalisierung und Geschäftsmodell-Innovation",
    "text": "Die Digitalisierung hat die Geschäftswelt revolutioniert und erfordert von Unternehmen eine kontinuierliche Anpassung und Innovation ihrer Geschäftsmodelle, um im Wettbewerb erfolgreich zu sein. In dieser Arbeit werden die Bedeutung der Geschäftsmodell-Innovation im Zeitalter der Digitalisierung untersucht und erfolgreiche Strategien zur Transformation von Unternehmen betrachtet.",
    "moduleId": "DIT41",
    "imageDescription": "Modern phones, tablets and laptops lying on wooden table",
    "date": "26.06.2022"
  }
]
