[
  {
    "name": "Repeatio",
    "technologies": [
      "React",
      "TypeScript",
      "Git",
      "Cypress",
      "Markdown"
    ],
    "description": "A web-based application to practice for exams. With an intuitive editor, users can easily create questions and style them with markdown. The application offers a range of question types including multiple-choice, multiple-response, match, and fill-in-the-blanks. Built with shareability in mind.",
    "links": {
      "primary": {
        "text": "VIEW",
        "link": "https://www.repeatio.de"
      },
      "secondary": {
        "text": "GitHub",
        "link": "https://github.com/Rllyyy/repeatio"
      }
    },
    "carouselItems": [
      {
        "type": "image",
        "resource": "/projects/repeatio/3-mobile.png",
        "alt": "Three UI mockups in phone format for learning app. The left mockup shows the module overview with three modules. The mockup in the center displays a modal with the title Edit Question and a form with which the user can edit a question. The question type Multiple-Choice is selected an the following radio options were added: Ruby, Rust, SQL, Markdown and CSS. The radio option CSS is selected. At the bottom of the form there is a button with the text Update. On the right mockup the question from the centered mockup is displayed. The title of the question is 'Which of the following is used to style web pages?'. Below the title is the points value (5) for this question if answered correctly. In cursive below the points is a text describing what the user has to do: 'Select the correct answer'. From the radio options Ruby, Rust, SQL, Markdown and CSS the user has selected CSS. Below the options there is a green box with the text: 'Yes, that's correct!'"
      },
      {
        "type": "image",
        "resource": "/projects/repeatio/multiple-response.png",
        "alt": "UI mockup of a multiple response question with the title 'Which of the following are HTTP response codes?'. The following multiple response options are selected: '200 OK', '400 Bad Request', '404 Page Not found'. These options are not selected: '600 Invalid Response' and '505 Internal Server Error'."
      },
      {
        "type": "image",
        "resource": "/projects/repeatio/extended-match.png",
        "alt": "UI mockup of a match question in the chrome browser where the user has to correctly match items from two columns by drawing lines between them. The title of the question is 'Match the following web technologies with their description or purpose'. The items on the left side are: CSS, HTML, Git, React, Svelte and NextJs. The items on the right side are partially cut of: 'JavaScript for ...', 'A popular version co...', 'Markup language use...', 'language used for styling...' and 'Framework based on...'. The options are connected by a line: 'NextJs and Framework based on', 'Svelte and JavaScript library for', 'React and JavaScript library for', 'Git and A popular version control...'."
      },
      {
        "type": "image",
        "resource": "/projects/repeatio/import-create.png",
        "alt": "Two mockup of phones with a form titled Create or import a Module. On the left mockup the option 'Import Module' is selected'. The user has imported 4 modules. On the right mockup the option 'Create Module' is selected. The user is filled in the following inputs in the form. ID: RW-01. Name: Grundlagen Rechnungswesen. Language: German. Compatibility Version: 0.5.0 ."
      },
      {
        "type": "video",
        "resource": "https://www.youtube-nocookie.com/embed/GgP1WLHhPMY"
      }
    ]
  },
  {
    "name": "Internet-Check",
    "technologies": [
      "C#",
      "Git",
      "Markdown"
    ],
    "links": {
      "primary": {
        "text": "GitHub",
        "link": "https://github.com/Rllyyy/Internet-Check"
      }
    },
    "description": "A lightweight windows based application to track and record network downtime. Customize the application to your preferences, including a dark mode and custom servers. Never miss a moment of network downtime with an auto-start and notifications. The software was downloaded over 1.4 thousand times.",
    "carouselItems": [
      {
        "type": "image",
        "resource": "/projects/Internet-Check/main.png",
        "alt": "Mockup of software recording internet downtime. The program has a simple UI in white at the top and black at the bottom with white taking up most of the interface. The main form is made up of 4 buttons: Start, Open, Clear and Settings. At the bottom there are two elements: Interval (sec): 30 and Waiting... ."
      },
      {
        "type": "image",
        "resource": "/projects/Internet-Check/settings.png",
        "alt": "Mockup of settings page."
      },
      {
        "type": "image",
        "resource": "/projects/Internet-Check/results.png",
        "alt": "Mockup of windows notepad showing internet outage with a timestamp."
      },
      {
        "type": "image",
        "resource": "/projects/Internet-Check/toast.png",
        "alt": "Toast showing 'Connection lost'"
      }
    ]
  },
  {
    "name": "Webinar Certificates",
    "technologies": [
      "C#",
      "Git"
    ],
    "description": "A custom software solution created for a former employer to generate and send certificates of attendance for webinars. The implementation of the program resulted in a significant reduction in process time and the elimination of previously common errors.",
    "carouselItems": [
      {
        "type": "image",
        "resource": "/projects/Webinar-Certificates/certificate.png",
        "alt": "Mockup of a webinar certificate."
      },
      {
        "type": "image",
        "resource": "/projects/Webinar-Certificates/main.png",
        "alt": "Mockup of software used to create webinar certificates."
      }
    ]
  },
  {
    "name": "Portfolio",
    "technologies": [
      "Next.js",
      "TypeScript",
      "TailwindCSS",
      "Cypress",
      "Git"
    ],
    "description": "A personal portfolio site built with Next.js and TailwindCSS to showcase personal projects, skills and academic work. An optimized image loader ensures efficient loading times. This website also supports a dark mode feature.",
    "carouselItems": [
      {
        "type": "image",
        "resource": "/projects/portfolio/hero-section.png",
        "alt": "Mockup of this website showing the hero-section."
      },
      {
        "type": "image",
        "resource": "/projects/portfolio/skills-light-dark.png",
        "alt": "Mockup of this website showing skills section of this website in dark and light color scheme."
      },
      {
        "type": "image",
        "resource": "/projects/portfolio/mobile.png",
        "alt": "Three mockups showing a project with a youtube video, the academic assignments section of this website and the hero section of this website."
      }
    ],
    "links": {
      "primary": {
        "text": "VISIT",
        "link": "https://www.niklasfischer.dev"
      },
      "secondary": {
        "text": "GitHub",
        "link": "https://github.com/Rllyyy/portfolio"
      }
    }
  }
]